#### `success` Terraform Format and Style
#### `success` Terraform Initialization
#### ️`success` Terraform Validation
#### `success` Terraform Plan
#### Please check the service here: http://myservice-test-391915452.us-east-2.elb.amazonaws.com

<details><summary>Show Plan</summary>

```terraform
[0m[1mmodule.webserver_cluster.aws_vpc.myservice_vpc: Refreshing state... [id=vpc-00d57d3f5ff308fff][0m
[0m[1mmodule.webserver_cluster.aws_internet_gateway.gw: Refreshing state... [id=igw-0139d2fab4282e116][0m
[0m[1mmodule.webserver_cluster.aws_security_group.elb: Refreshing state... [id=sg-04d1a1f479851fb66][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_a: Refreshing state... [id=subnet-0cd9bf5b88a91b14b][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_b: Refreshing state... [id=subnet-09fcad594ab6331f9][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_c: Refreshing state... [id=subnet-0b9b400e1b2091d7c][0m
[0m[1mmodule.webserver_cluster.aws_route_table.r: Refreshing state... [id=rtb-09e29df9d85cb06bf][0m
[0m[1mmodule.webserver_cluster.aws_db_subnet_group.myservice: Refreshing state... [id=myservice-rds-subnet-group][0m
[0m[1mmodule.webserver_cluster.aws_elb.myservice: Refreshing state... [id=myservice-test][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a3: Refreshing state... [id=rtbassoc-03bab3b2cb4a5b12d][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a2: Refreshing state... [id=rtbassoc-014a0af6f761b58b6][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a1: Refreshing state... [id=rtbassoc-09952ae022b7baca5][0m
[0m[1mmodule.webserver_cluster.aws_db_instance.myservice-db: Refreshing state... [id=terraform-20210326074004963300000001][0m
[0m[1mmodule.webserver_cluster.aws_launch_configuration.myservice: Refreshing state... [id=myservice-test20210326074331449200000002][0m
[0m[1mmodule.webserver_cluster.aws_autoscaling_group.myservice: Refreshing state... [id=myservice-test][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[32m+[0m/[31m-[0m create replacement and then destroy
[0m
Terraform will perform the following actions:

[1m  # module.webserver_cluster.aws_autoscaling_group.myservice[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_autoscaling_group" "myservice" {
        [1m[0mid[0m[0m                        = "myservice-test"
      [33m~[0m [0m[1m[0mlaunch_configuration[0m[0m      = "myservice-test20210326074331449200000002" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                      = "myservice-test"
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.webserver_cluster.aws_launch_configuration.myservice[0m must be [1m[31mreplaced[0m[0m
[0m[32m+[0m/[31m-[0m[0m resource "aws_launch_configuration" "myservice" {
      [33m~[0m [0m[1m[0marn[0m[0m                              = "arn:aws:autoscaling:us-east-2:307150142929:launchConfiguration:cdabe1e5-b48d-4443-9f71-bc23ea75da80:launchConfigurationName/myservice-test20210326074331449200000002" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mebs_optimized[0m[0m                    = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                               = "myservice-test20210326074331449200000002" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                             = "myservice-test20210326074331449200000002" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0muser_data[0m[0m                        = "183a980e658a06386be73b847a1ad9b26e59f34b" [33m->[0m [0m"a868d8787b61db0adec61ebfc8f1a8791aa6cbd4" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mvpc_classic_link_security_groups[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
        [90m# (7 unchanged attributes hidden)[0m[0m

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @behoof4mind, Action: `pull_request`, Workflow: `Create PR Env`*